Revit 2027 API
Application.WorksharedOperationProgressChanged Event
 Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<WorksharedOperationProgressChangedEventArgs> WorksharedOperationProgressChanged
Public Event WorksharedOperationProgressChanged As EventHandler(Of WorksharedOperationProgressChangedEventArgs)
public:
 event EventHandler<WorksharedOperationProgressChangedEventArgs^>^ WorksharedOperationProgressChanged {
	void add (EventHandler<WorksharedOperationProgressChangedEventArgs^>^ value);
	void remove (EventHandler<WorksharedOperationProgressChangedEventArgs^>^ value);
}
member WorksharedOperationProgressChanged : IEvent<EventHandler<WorksharedOperationProgressChangedEventArgs>,
    WorksharedOperationProgressChangedEventArgs>
Value
EventHandler<WorksharedOperationProgressChangedEventArgs>
Remarks
 This event is only supported for Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow. Users may not change the document in the handler for this event. It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time." Exception ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace